<?php

use Illuminate\Database\Seeder;

class PostsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('posts')->insert([
            'title' => 'Факты и мифы о моторном масле',
            'thumbnail' => 'public/posts/maslo.jpg',
            'image' => 'public/posts/maslo.jpg',
            'body' => '<div>
    Вы знаете, что черный цвет масла не обязательно означает, что оно отработало свое? Или в машине, которая ездит мало, нужно менять масло реже, а выбирая масло, должны обратить внимание является оно минеральным или синтетическим? Объяснение можно найти ниже.<br />
    <br />
    <strong>Факты</strong></div>
<div>
    <br />
    <strong>Синтетическое масло лучше, чем &nbsp;минеральное и полусинтетическое</strong><br />
    <br />
    Синтетические масла термически более стабильны, то есть их вязкость зависит от температуры в меньшей степени, чем для других типов масел. Они также более устойчивы к высоким температурам и поддерживают текучесть даже при -60 &deg;С</div>
<div>
    Масло должно&nbsp;меняться &nbsp;часто, даже чаще, чем рекомендовано производителем<br />
    <br />
    Конечно, вы не должны переусердствовать, но двигателю, явно не помешает менять масло каждые 10 или 15 тысяч км, вместо рекомендованных изготовителем, например 30 тысяч км, даже при использовании масла адаптированного для работы Longlife(для удлиненного интервала замены ).</div>
<div>
    Эксплуатировать&nbsp;автомобиль со слишком низким уровнем масла опасно<br />
    <br />
    Между отметок, указывающих минимальный и максимальный уровень масла на масляном щупе находится обычно 0,5-1 л масла, или примерно 20 процентов общего объема масла. Вождение с низким уровнем масла может ухудшить качество смазки, соответственно это шаг к увеличению износа компонентов двигателя.</div>
<div>
    <br />
    <strong>Существуют&nbsp;масла для &nbsp;конкретных двигателей</strong><br />
    <br />
    Ведущие производители масел, много лет работают с производителями автомобилей, что позволяет производить масла с учетом потребностей конкретных двигателей. Сотрудничество начинается на стадии проектирования двигателя, поэтому необходимо смотреть не на вязкость и состав масла(синтетическое, минеральное, полусинтетическое), а на то, допущено ли данное масло для использования в данном двигателе, т.е. на допуски и рекомендации.</div>
<div>
    То же самое&nbsp;масло можно использовать в бензиновых и дизельных двигателях<br />
    <br />
    Современные масла можно использовать в обоих типах двигателей. Только необходимо проверить или производитель не требуют особого типа масла, например из-за сажевого фильтра DPF (например Castrol EDGE Professional LongLife III 5W-30 DPF).</div>
<div>
    <br />
    <strong>Масло&nbsp;влияет на расход топлива</strong><br />
    <br />
    Тип масла и его вязкость может увеличивать или уменьшать расход топлива. Чуть выше сопротивление для двигателя делают такие масла, как минеральное масло или масло с высокой вязкостью, например 20W-60. Тем не менее, различия не слишком велики.</div>
<div>
    Мифы</div>
<div>
    <br />
    <strong>Черный цвет масла означает, что оно отработало свой ресурс.</strong><br />
    <br />
    Масло может изменить цвет даже спустя несколько километров после замены. Наиболее часто это происходит в дизельных двигателях, в связи с дисперсией (раздробления) сажевых частиц. Это не означает, что нужно заменить его.</div>
<div>
    При выборе масла, достаточно обратить внимание на тип&nbsp;</div>
<div>
    (минеральное / синтетическое / полусинтетическое)<br />
    <br />
    Это совершенно не так - выбирая масло, необходимо, прежде всего обратить внимание на его качество и вязкость. Конечно, лучше выбрать синтетическое масло, но более важным является соблюдение параметров качества и вязкости с рекомендациями производителя автомобиля.</div>
<div>
    <br />
    <strong>Доливаться должно такое же масло, что заливалось в двигатель</strong><br />
    <br />
    Конечно, это лучше, но моторные масла смешиваются (более высокого класса, чем качество SG API), так что для доливки можно использовать другое масло. Стоит отметить, что оно должно быть как можно ближе по качеству и вязкости.</div>
<div>
    <br />
    Масло в машине, которая ездит мало, должно меняться гораздо реже<br />
    <br />
    В автомобиле, который используется редко, масло должно меняться не дожидаясь пробега в 10 тысяч км, а раз в год. Масло стареет даже в неработающем автомобиле, например, из-за контакта с воздухом.</div>
<div>
    Двигатели с&nbsp;большим пробегом должны работать на минеральном масле<br />
    <br />
    Независимо от пробега, если двигатель работал на синтетическом масле, а расход масла на угар, между заменами не слишком большой, нет необходимости менять его на минеральное или полусинтетическое, и опять же необходимо смотреть допуски производителей.</div>',
            'created_at' => date("2017-12-24 09:10:17"),
            'ismain' => 1
        ]);
        DB::table('posts')->insert([
            'title' => 'Летняя Жидкость в Бачок омывателя необходима! ',
            'thumbnail' => 'public/posts/42.jpg',
            'image' => 'public/posts/42.jpg',
            'body' => '<p>
    Безопасность движения автомобиля зависит от многих факторов. Немаловажную роль в этом играет и чистота лобового стекла. Казалось бы, залил в бачок омывателя первую попавшуюся под руку жидкость и поехал. Но не все так просто&hellip;</p>
<p>
    На первый взгляд, лобовое стекло не требует к себе внимания: в случае появления загрязнений очистить стекло помогают дворники. Но через некоторое время начинаешь обращать внимание, что на стекле появились царапинки, которые на солнце или во время ночной езды, искажая световой поток от встречного автомобиля, буквально &laquo;играют&raquo; перед глазами, отвлекают от дороги и мешают сосредоточиться. В чем причина, почему они появились на стекле?</p>
<p>
    Лобовое стекло ничем не защищено от воздействия внешних факторов. Грязь, абразивные частички, остатки масел, жиров, смол, частицы силиконовых и восковых продуктов, насекомых &ndash; все это попадает на поверхность стекла. Чтобы от них избавиться, обычной воды, которую иногда заливают в бачок стеклоомывателя некоторые автовладельцы, недостаточно. Если загрязнения еще не засохли, она может привести к размазыванию их по поверхности стекла, а если они уже достаточно давно на стекле &ndash; может не справиться с их удалением. К тому же использование воды &ndash; едва ли наиболее явная причина появления царапинок на стекле. Ведь, поскольку грязь будет плохо удаляться, стеклоочистителям потребуется больше движений, во время которых часть твердых частичек будет переноситься то в одну, то в другую сторону. Помимо этого, частички в тонких слоях маслянистых или жирных пленок будут &laquo;перекатываться&raquo; по поверхности стекла, оставляя за собой мелкие следы. То же самое, хотя, возможно, с меньшими последствиями, можно сказать и об использовании неправильно разбавленного концентрата стеклоомывающей жидкости с водой, когда в целях экономии минимизируют количество самой базы (концентрата), не говоря уже о поддельных продуктах. К чему может привести применение таких жидкостей, полагаем, объяснять не нужно. Применение же некачественной стеклоомывающей жидкости будет плохо удалять загрязнения, что приведет к снижению прозрачности стекла, ухудшению обзорности и, тем самым, снизит безопасность движения.</p>
<p>
    Поэтому всем автолюбителям, которые заботятся не только о своем автомобиле, но и о собственном здоровье и безопасности движения , компания TANAUTO KAZAKHSTAN, ведущий Казахстанский поставщик автохимии, предлагает специальные летние стеклоомывающие жидкости BARDAHL(Бардаль) -7С. В чем же преимущества использования данных продуктов? Итак, жидкости для бачка омывателя BARDAHL(Бардаль):</p>
<p>
    1. Обладают прекрасными моющими свойствами и легко справляются с такими загрязнениями, как жирная или маслянистая грязь, следами от насекомых и т.п. Помимо этого, обеспечивают чистоту системы и ее надежную работу.<br />
    2. Содержат в своем составе оптимально сбалансированный пакет поверхностно-активных веществ (ПАВ), которые обволакивают мелкие частицы грязи, предотвращая их контакт с очищаемой поверхностью. Следовательно, минимизируют появление царапин на стекле, а также способствуют продлению срока службы щеток, снижая их абразивный износ.<br />
    3. Произведены с применением специальной добавки, которая включена в рецептуру непосредственно для удаления следов насекомых с поверхности автомобильного стекла.<br />
    4. Нейтральны к резиновым и пластиковым деталям, а также лакокрасочному покрытию автомобиля.<br />
    5. Обладают оптимальным пенообразованием, не оставляют на поверхности стекла жирных пленок и радужных разводов.<br />
    6. Безопасны для человека, поскольку не содержат в своем составе метанол, который является ядовитым веществом.<br />
    Таким образом, использование стеклоомывающих жидкостей Бардаль гарантирует чистоту лобового стекла, позволяет максимально защитить его от появления царапин, способствует надежной работе всей системы, обеспечивая тем самым безопасность управления автомобилем.</p>
<p>
    Говоря об очистке стекол, следует упомянуть еще об одном продукте из производственной линейки компании TANAUTO KAZAKHSTAN. Это &ndash; очиститель следов насекомых, который предлагается в упаковке с распылителем. Продукт предназначен для быстрого и легкого удаления следов насекомых с внешней стороны автомобильных стекол, пластиковых и хромированных бамперов, капота, решеток радиатора. Средство безопасно для резиновых и пластиковых элементов автомобиля, нейтрально к лакокрасочному покрытию. Позволяет легко удалить свежие и засохшие следы насекомых, а также другие загрязнения с очищаемых поверхностей. Высокая очищающая способность позволяет экономно расходовать продукт.</p>',
            'created_at' => date("2017-12-24 09:10:17"),
            'ismain' => 1
        ]);
        DB::table('posts')->insert([
            'title' => 'Чем синтетические масла отличаются от минеральных?',
            'thumbnail' => 'public/posts/20171227_135616_834.jpg',
            'body' => '<p>
    Многие знают, что синтетические масла работают лучше, чем минеральные, но не каждый сможет объяснить, почему это так. В чём основное отличие синтетических моторных масел от минеральных? Практически во всём.&nbsp;<br />
    <br />
    Минеральное масло фактически добывается из земли &ndash; это просто очищенная сырая нефть. Синтетическое масло (полностью синтетическое или полусинтетика) создается в лаборатории.&nbsp;<br />
    <br />
    При производстве синтетического масла нефть не только очищается, но и проходит процесс перегонки и затем перерабатывается до основных молекул. Потом из этих молекул составляется базовое масло и улучшается с помощью присадок, благодаря которым конечный продукт будет обладать исключительными рабочими свойствами: надежно защищать от износа, воздействия экстремальных температур и образования шламовых отложений. Данный процесс позволяет не только удалять больше примесей из сырой нефти, но и обрабатывать каждую отдельную молекулу масла в соответствии с потребностями современного двигателя внутреннего сгорания. Такие &laquo;обработанные&raquo; молекулы гарантируют более высокий уровень защиты и эффективности и помогают двигателю работать без сбоев еще дольше.<br />
    <br />
    В чём же преимущество синтетического масла? Вот как все эти химические процессы работают в реальной жизни:</p>
<h3>
    Чистый двигатель</h3>
<p>
    При циркуляции в двигателе масло может накапливать осадок. Если использовать минеральный продукт, со временем внутри мотора могут образоваться шламовые отложения, из-за которых снизится эффективность работы двигателя, а в итоге сократится срок его службы. Синтетические моторные масла содержат меньше примесей, чем минеральные, и более эффективно борются с образованием шлама, что позволяет им надежно защищать Ваш двигатель от появления отложений.</p>
<h3>
    Надежная защита от износа</h3>
<p>
    Детали двигателя находятся в постоянном контакте друг с другом, при этом двигаясь с высокой скоростью. Работа в таких экстремальных условиях может вызвать износ и поломку. Защитным барьером между деталями является моторное масло. Минеральное масло в какой-то момент начинает разрушаться и терять свои защитные функции. Синтетические масла, напротив, сохраняют возможность обеспечивать защиту от износа намного дольше, таким образом увеличивая срок службы двигателя.</p>
<h3>
    Отличная текучесть при низких температурах</h3>
<p>
    Когда автомобиль стоит на месте какое-то время с неработающим двигателем (например, ночью), масло густеет. Но когда Вы включаете зажигание, оно начинает прокачиваться, защищая детали двигателя от трения. Минеральным маслам нужно больше времени, чтобы начать полноценно циркулировать в двигателе. В зимнее время или в регионах с экстремально холодным климатом этот процесс занимает еще больше времени. Синтетические масла, напротив, созданы по специальной технологии, которая позволяет им сохранять отличную текучесть даже при низких температурах: они начинают защищать Ваш двигатель, как только Вы заводите машину.</p>
<h3>
    Надежная защита при высоких температурах</h3>
<p>
    Во время работы двигатель нагревается. Очень сильно. Со временем под воздействием высоких температур минеральное моторное масло может разрушиться или испариться, что приведет к износу двигателя. Синтетические масла обладают высокой термостойкостью, что особенно важно при вождении в жарком климате.</p>
<h3>
    Защита важных деталей турбонагнетателя</h3>
<p>
    Автопроизводители стремятся учесть пожелания потребителей и выпускают автомобили с более компактными двигателями (чтобы экономить больше топлива), но при этом устанавливают турбонагнетатели (чтобы прибавить мощности). Мы уже говорили, как сильно нагревается двигатель во время работы и почему минеральное масло в таких условиях может быстро разрушиться, но стоит отметить, что в современных турбированных двигателях среда еще более агрессивна. Вал турбокомпрессора может вращаться со скоростью 200 000 оборотов в минуту, поэтому крайне важно, чтобы масло могло очень быстро добраться до вала и как следует смазать его. В таких условиях минеральные масла могут быстро разрушаться и оставлять отложения на деталях турбокомпрессора, что приведет к его поломке. Синтетические масла защищают такие детали намного эффективнее, чем минеральные, благодаря чему они отлично работают и добавляют мощности Вашему двигателю.</p>
',
            'created_at' => date("2017-12-24 09:10:17"),
            'ismain' => 1
        ]);
        
    }
}
